# YOLOv8n + CBAM 注意力机制检测模型。
# 该配置在 YOLOv8n 的主干网络末端加入 CBAM 模块，用于增强通道与空间关键区域表达。
# 为了避免修改 Ultralytics 源码，本配置使用 Ultralytics 已内置的 CBAM 模块。

nc: 3

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]      # 1-P2/4
  - [-1, 1, C2f, [32, True]]       # 2
  - [-1, 1, Conv, [64, 3, 2]]      # 3-P3/8
  - [-1, 2, C2f, [64, True]]       # 4
  - [-1, 1, Conv, [128, 3, 2]]     # 5-P4/16
  - [-1, 2, C2f, [128, True]]      # 6
  - [-1, 1, Conv, [256, 3, 2]]     # 7-P5/32
  - [-1, 1, C2f, [256, True]]      # 8
  - [-1, 1, SPPF, [256, 5]]        # 9
  - [-1, 1, CBAM, [256]]           # 10 注意力模块：强化疲劳相关局部特征

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # cat backbone P4
  - [-1, 1, C2f, [128]]            # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # cat backbone P3
  - [-1, 1, C2f, [64]]             # 16 (P3/8-small)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # cat head P4
  - [-1, 1, C2f, [128]]            # 19 (P4/16-medium)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # cat head P5 with CBAM output
  - [-1, 1, C2f, [256]]            # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]

